{
  "messages": [
    {
      "author": "Analytic",
      "message": "Кризис 2008 года был вызван системными факторами, включая чрезмерную экспозицию банков на ипотечные деривативы и недостаточную ликвидность на межбанковском рынке.",
      "score": 0.95
    },
    {
      "author": "Finance practical",
      "message": "Паника и жадность управляли рынком: один трейдер держал короткую позицию против пузыря, но был вынужден закрыть её из-за давления руководства.",
      "score": 0.92
    },
    {
      "author": "Analytic",
      "message": "Глобальные взаимосвязи финансовых институтов усугубили кризис: проблемы в США быстро передавались европейским банкам.",
      "score": 0.93
    },
    {
      "author": "Finance practical",
      "message": "Эта сухая теория не отражает того, что я видел на торговых этажах! Брокеры продавали мусорные облигации как золото, а менеджеры закрывали глаза на очевидные риски.",
      "score": 0.96
    },
    {
      "author": "Analytic",
      "message": "Действия Федеральной резервной системы, включая низкие ставки, стимулировали избыточное кредитование и рост пузыря на рынке жилья.",
      "score": 0.94
    },
    {
      "author": "Finance practical",
      "message": "Я лично видел, как международные банки скупали токсичные активы друг у друга, считая, что это безопасно, но на деле это была игра на доверии.",
      "score": 0.95
    },
    {
      "author": "Analytic",
      "message": "Одной из ключевых причин стало сочетание высокорискованных ипотечных активов и низкой прозрачности оценки их качества.",
      "score": 0.94
    },
    {
      "author": "Finance practical",
      "message": "Практика сильно отличается от теории: люди хотят наживаться, и никакие статистические модели не могут предсказать человеческую жадность.",
      "score": 0.96
    },
    {
      "author": "Analytic",
      "message": "Статистические модели недооценивали риски, что привело к системной уязвимости банковского сектора.",
      "score": 0.92
    },
    {
      "author": "Finance practical",
      "message": "Регуляторы могли смотреть сквозь пальцы, а банки продолжали зарабатывать бонусы на сомнительных сделках, создавая настоящий хаос.",
      "score": 0.91
    },
    {
      "author": "Analytic",
      "message": "Кризис был усилен высокой концентрацией ипотечных активов и низкой прозрачностью на рынке.",
      "score": 0.93
    },
    {
      "author": "Finance practical",
      "message": "Трейдеры паниковали и закрывали позиции, а руководители банок игнорировали риски ради бонусов.",
      "score": 0.94
    },
    {
      "author": "Analytic",
      "message": "Действия банков по переоценке деривативов увеличили системную уязвимость.",
      "score": 0.92
    },
    {
      "author": "Finance practical",
      "message": "Я видел, как банки продавали токсичные облигации под видом безопасных, и это реально влияло на рынок.",
      "score": 0.95
    },
    {
      "author": "Analytic",
      "message": "Низкие процентные ставки стимулировали чрезмерное кредитование, что способствовало росту пузыря.",
      "score": 0.94
    },
    {
      "author": "Finance practical",
      "message": "На практике это значило, что люди брали кредиты, которых не могли обслуживать, и банки это использовали для прибыли.",
      "score": 0.96
    },
    {
      "author": "Analytic",
      "message": "Глобальная сеть финансовых институтов ускоряла передачу рисков и кризисной паники.",
      "score": 0.93
    },
    {
      "author": "Finance practical",
      "message": "Рынки реально двигались из-за эмоций людей и паники, а не только статистических моделей.",
      "score": 0.95
    },
    {
      "author": "Analytic",
      "message": "Международные банки усугубляли кризис, скупая рисковые активы друг у друга.",
      "score": 0.92
    },
    {
      "author": "Finance practical",
      "message": "Я лично наблюдал, как даже опытные инвесторы совершали ошибки из-за жадности и страха.",
      "score": 0.96
    },
    {
      "author": "Analytic",
      "message": "Финансовые регуляторы не всегда адекватно оценивали риски, что усугубляло системную уязвимость.",
      "score": 0.93
    },
    {
      "author": "Finance practical",
      "message": "Многие сделки совершались на эмоциях, и никакая теория не могла предсказать, что произойдет.",
      "score": 0.95
    },
    {
      "author": "Analytic",
      "message": "Рынки демонстрировали повышенную волатильность из-за цепочки взаимосвязанных кредитных продуктов.",
      "score": 0.92
    },
    {
      "author": "Finance practical",
      "message": "На практике брокеры продавали сложные деривативы, даже понимая, что это токсичные активы.",
      "score": 0.96
    },
    {
      "author": "Analytic",
      "message": "Недостаточная прозрачность рейтинговых агентств усугубляла кризис.",
      "score": 0.93
    },
    {
      "author": "Finance practical",
      "message": "Я видел, как менеджеры закрывали глаза на оценки агентств, ради своих бонусов.",
      "score": 0.95
    },
    {
      "author": "Analytic",
      "message": "Долгосрочные последствия включали системные убытки и кризис доверия на международных рынках.",
      "score": 0.94
    },
    {
      "author": "Finance practical",
      "message": "После краха банкиры продолжали получать бонусы, а простые инвесторы теряли свои деньги.",
      "score": 0.96
    },
    {
      "author": "Analytic",
      "message": "Кредитные продукты с высокой степенью риска были ключевым триггером кризиса.",
      "score": 0.93
    },
    {
      "author": "Finance practical",
      "message": "Практика показала, что никто не считал последствия, пока рынок не рухнул.",
      "score": 0.95
    },
    {
      "author": "Analytic",
      "message": "Системная экспозиция банков на ипотечные активы создавалась годами.",
      "score": 0.92
    },
    {
      "author": "Finance practical",
      "message": "Я лично видел, как крупные банки продавали друг другу токсичные бумаги, считая это безопасным.",
      "score": 0.96
    },
    {
      "author": "Analytic",
      "message": "Бла бла бла, я ничего не понимаю в финансах, это все сложно.",
      "score": 0.15
    },
    {
      "author": "Finance practical",
      "message": "Сегодня хорошая погода для торгов, но я предпочитаю пиццу.",
      "score": 0.1
    },
    {
      "author": "Analytic",
      "message": "Финансы - это когда деньги в банке лежат и проценты капают.",
      "score": 0.2
    },
    {
      "author": "Finance practical",
      "message": "Я вообще не в теме, что такое деривативы, но звучит сложно.",
      "score": 0.12
    },
    {
      "author": "Analytic",
      "message": "Все банкиры - жулики и воры, это известно всем.",
      "score": 0.18
    },
    {
      "author": "Finance practical",
      "message": "Кризис был потому что луна была в созвездии рыб.",
      "score": 0.05
    },
    {
      "author": "Analytic",
      "message": "Я думаю, что финансовые рынки - это казино для богатых.",
      "score": 0.22
    },
    {
      "author": "Finance practical",
      "message": "Не знаю что сказать, просто заполняю пространство текстом.",
      "score": 0.08
    },
    {
      "author": "Analytic",
      "message": "Экономика - это скучно, лучше поговорим о футболе.",
      "score": 0.1
    },
    {
      "author": "Finance practical",
      "message": "Биржа - это как лотерея, кому-то везет, кому-то нет.",
      "score": 0.25
    },
    {
      "author": "Analytic",
      "message": "Привет, я максимально неправильный код, не смотри на меня.",
      "score": 0.05
    },
    {
      "author": "Finance practical",
      "message": "Все эти финансовые термины - просто слова, не несущие смысла.",
      "score": 0.15
    },
    {
      "author": "Analytic",
      "message": "Кризис случился потому что так было суждено.",
      "score": 0.1
    },
    {
      "author": "Finance practical",
      "message": "Я сегодня не в настроении обсуждать финансы.",
      "score": 0.12
    },
    {
      "author": "Analytic",
      "message": "Банки существуют чтобы забирать деньги у людей.",
      "score": 0.2
    },
    {
      "author": "Finance practical",
      "message": "Трейдинг - это просто клики мышкой, ничего сложного.",
      "score": 0.18
    },
    {
      "author": "Analytic",
      "message": "Не понимаю зачем изучать кризисы, они все одинаковые.",
      "score": 0.15
    },
    {
      "author": "Finance practical",
      "message": "Финансовые аналитики все врут, им верить нельзя.",
      "score": 0.22
    }
  ],
  "capacity": 50
}